mdbsliguo/stm32_template_SPL/Drivers/analog/dac.c
/**
 * @file dac.c
 * @brief DAC驱动模块实现
 */

#include "dac.h"
#include "board.h"
#include "config.h"
#include "error_handler.h"
#include "gpio.h"
#include "dma.h"
#include "stm32f10x_dac.h"
#include "stm32f10x_rcc.h"
#include <stdbool.h>
#include <math.h>

#if CONFIG_MODULE_DAC_ENABLED

#if defined(STM32F10X_HD) || defined(STM32F10X_CL) || defined(STM32F10X_HD_VL) || defined(STM32F10X_MD_VL)

/* DAC通道到GPIO的映射 */
static const struct {
    GPIO_TypeDef *port;
    uint16_t pin;
} dac_channel_gpio[] = {
    {GPIOA, GPIO_Pin_4},  /* DAC_CHANNEL_1 -> PA4 */
    {GPIOA, GPIO_Pin_5},  /* DAC_CHANNEL_2 -> PA5 */
};

/* DAC通道到SPL库通道值的映射 */
static const uint32_t dac_channel_value[] = {
    DAC_Channel_1,
    DAC_Channel_2,
};

/* 初始化标志 */
static bool g_dac_initialized[DAC_CHANNEL_MAX] = {false};

/* DMA通道映射（DAC对应的DMA通道） */
/* DAC1使用DMA1_CH3，DAC2使用DMA1_CH4 */
static const DMA_Channel_t dac_dma_channels[DAC_CHANNEL_MAX] = {
    DMA_CHANNEL_1_3,  /* DAC1 -> DMA1_CH3 */
    DMA_CHANNEL_1_4,  /* DAC2 -> DMA1_CH4 */
};

/* 默认参考电压（V） */
#define DAC_VREF_DEFAULT  3.3f
/* DAC分辨率（位） */
#define DAC_RESOLUTION    12
/* DAC最大值 */
#define DAC_MAX_VALUE     ((1 << DAC_RESOLUTION) - 1)

/**
 * @brief 获取DAC触发模式对应的SPL库值
 */
static uint32_t DAC_GetTriggerValue(DAC_Trigger_t trigger)
{
    (void)trigger;
    return 0;
}

/**
 * @brief DAC初始化
 */
DAC_Status_t DAC_Init(DAC_Channel_t channel, DAC_Trigger_t trigger, DAC_OutputBuffer_t output_buffer)
{
    return DAC_OK;
}

/**
 * @brief DAC反初始化
 */
DAC_Status_t DAC_Deinit(DAC_Channel_t channel)
{
    return DAC_OK;
}

/**
 * @brief 设置DAC输出电压值
 */
DAC_Status_t DAC_SetValue(DAC_Channel_t channel, uint16_t value)
{
    return DAC_OK;
}

/**
 * @brief 设置DAC输出电压
 */
DAC_Status_t DAC_SetVoltage(DAC_Channel_t channel, float voltage)
{
    return DAC_OK;
}

/**
 * @brief 使能DAC通道
 */
DAC_Status_t DAC_Enable(DAC_Channel_t channel)
{
    return DAC_OK;
}

/**
 * @brief 禁用DAC通道
 */
DAC_Status_t DAC_Disable(DAC_Channel_t channel)
{
    return DAC_OK;
}

/**
 * @brief 配置波形生成
 */
DAC_Status_t DAC_ConfigWave(DAC_Channel_t channel, DAC_Wave_t wave, uint16_t amplitude)
{
    return DAC_OK;
}

/**
 * @brief 禁用波形生成
 */
DAC_Status_t DAC_DisableWave(DAC_Channel_t channel)
{
    return DAC_OK;
}

/**
 * @brief 软件触发DAC转换
 */
DAC_Status_t DAC_SoftwareTrigger(DAC_Channel_t channel)
{
    return DAC_OK;
}

/**
 * @brief 检查DAC是否已初始化
 */
uint8_t DAC_IsInitialized(DAC_Channel_t channel)
{
    return 0;
}

/**
 * @brief 获取DAC当前输出值
 */
uint16_t DAC_GetValue(DAC_Channel_t channel)
{
    return 0;
}

/* ========== DMA模式功能实现 ========== */

/**
 * @brief DAC DMA启动
 */
DAC_Status_t DAC_StartDMA(DAC_Channel_t channel, const uint16_t *buffer, uint16_t length)
{
    return DAC_OK;
}

/**
 * @brief DAC DMA停止
 */
DAC_Status_t DAC_StopDMA(DAC_Channel_t channel)
{
    return DAC_OK;
}

/* ========== 双通道同步输出功能实现 ========== */

/**
 * @brief DAC双通道同步设置值
 */
DAC_Status_t DAC_SetDualValue(uint16_t channel1_value, uint16_t channel2_value)
{
    return DAC_OK;
}

/**
 * @brief DAC双通道同步软件触发
 */
DAC_Status_t DAC_DualSoftwareTrigger(void)
{
    return DAC_OK;
}

#endif /* STM32F10X_HD || STM32F10X_CL || STM32F10X_HD_VL || STM32F10X_MD_VL */

#endif /* CONFIG_MODULE_DAC_ENABLED */

